Autodesk.Revit.DB.Structure.RebarGeometryType
Rebar geometry type

Autodesk.Revit.DB.Structure.RebarGeometryType.FreeForm
Free Form.

Autodesk.Revit.DB.Structure.RebarGeometryType.ShapeBased
Shape Driven.